jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/adc.h
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC12_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC12_NO_TRIGGER       (ADC_CHNCFG5_TRGSRC12_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position  */
#define ADC_CHNCFG5_TRGSRC12_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC12_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC12_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC12_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC12_SCAN_TRIGGER     (ADC_CHNCFG5_TRGSRC12_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG5_TRGSRC12_SYNC_TRIGGER     (ADC_CHNCFG5_TRGSRC12_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER0      (ADC_CHNCFG5_TRGSRC12_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER1      (ADC_CHNCFG5_TRGSRC12_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER2      (ADC_CHNCFG5_TRGSRC12_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER3      (ADC_CHNCFG5_TRGSRC12_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER4      (ADC_CHNCFG5_TRGSRC12_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER5      (ADC_CHNCFG5_TRGSRC12_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER6      (ADC_CHNCFG5_TRGSRC12_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER7      (ADC_CHNCFG5_TRGSRC12_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER8      (ADC_CHNCFG5_TRGSRC12_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER9      (ADC_CHNCFG5_TRGSRC12_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG5_TRGSRC12_EVENT_USER10     (ADC_CHNCFG5_TRGSRC12_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC12_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG5_TRGSRC13_Pos              _UINT32_(20)                                         /* (ADC_CHNCFG5) Channel 13 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC13_Msk              (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC13_Pos)          /* (ADC_CHNCFG5) Channel 13 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC13(value)           (ADC_CHNCFG5_TRGSRC13_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC13_Pos)) /* Assigment of value for TRGSRC13 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC13_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC13_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC13_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC13_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC13_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC13_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC13_NO_TRIGGER       (ADC_CHNCFG5_TRGSRC13_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position  */
#define ADC_CHNCFG5_TRGSRC13_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC13_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC13_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC13_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC13_SCAN_TRIGGER     (ADC_CHNCFG5_TRGSRC13_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG5_TRGSRC13_SYNC_TRIGGER     (ADC_CHNCFG5_TRGSRC13_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER0      (ADC_CHNCFG5_TRGSRC13_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER1      (ADC_CHNCFG5_TRGSRC13_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER2      (ADC_CHNCFG5_TRGSRC13_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER3      (ADC_CHNCFG5_TRGSRC13_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER4      (ADC_CHNCFG5_TRGSRC13_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER5      (ADC_CHNCFG5_TRGSRC13_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER6      (ADC_CHNCFG5_TRGSRC13_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER7      (ADC_CHNCFG5_TRGSRC13_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER8      (ADC_CHNCFG5_TRGSRC13_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER9      (ADC_CHNCFG5_TRGSRC13_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG5_TRGSRC13_EVENT_USER10     (ADC_CHNCFG5_TRGSRC13_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC13_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG5_TRGSRC14_Pos              _UINT32_(24)                                         /* (ADC_CHNCFG5) Channel 14 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC14_Msk              (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC14_Pos)          /* (ADC_CHNCFG5) Channel 14 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC14(value)           (ADC_CHNCFG5_TRGSRC14_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC14_Pos)) /* Assigment of value for TRGSRC14 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC14_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC14_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC14_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC14_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC14_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC14_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC14_NO_TRIGGER       (ADC_CHNCFG5_TRGSRC14_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position  */
#define ADC_CHNCFG5_TRGSRC14_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC14_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC14_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC14_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC14_SCAN_TRIGGER     (ADC_CHNCFG5_TRGSRC14_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG5_TRGSRC14_SYNC_TRIGGER     (ADC_CHNCFG5_TRGSRC14_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER0      (ADC_CHNCFG5_TRGSRC14_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER1      (ADC_CHNCFG5_TRGSRC14_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER2      (ADC_CHNCFG5_TRGSRC14_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER3      (ADC_CHNCFG5_TRGSRC14_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER4      (ADC_CHNCFG5_TRGSRC14_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER5      (ADC_CHNCFG5_TRGSRC14_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER6      (ADC_CHNCFG5_TRGSRC14_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER7      (ADC_CHNCFG5_TRGSRC14_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER8      (ADC_CHNCFG5_TRGSRC14_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER9      (ADC_CHNCFG5_TRGSRC14_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG5_TRGSRC14_EVENT_USER10     (ADC_CHNCFG5_TRGSRC14_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC14_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG5_TRGSRC15_Pos              _UINT32_(28)                                         /* (ADC_CHNCFG5) Channel 15 Trigger Source Position */
#define ADC_CHNCFG5_TRGSRC15_Msk              (_UINT32_(0xF) << ADC_CHNCFG5_TRGSRC15_Pos)          /* (ADC_CHNCFG5) Channel 15 Trigger Source Mask */
#define ADC_CHNCFG5_TRGSRC15(value)           (ADC_CHNCFG5_TRGSRC15_Msk & (_UINT32_(value) << ADC_CHNCFG5_TRGSRC15_Pos)) /* Assigment of value for TRGSRC15 in the ADC_CHNCFG5 register */
#define   ADC_CHNCFG5_TRGSRC15_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADC_CHNCFG5) No Trigger (NOP)  */
#define   ADC_CHNCFG5_TRGSRC15_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG5) Global Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC15_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG5) Global Level Software Trigger  */
#define   ADC_CHNCFG5_TRGSRC15_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG5) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG5_TRGSRC15_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG5) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 0  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 1  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 2  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 3  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 4  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 5  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 6  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 7  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 8  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 9  */
#define   ADC_CHNCFG5_TRGSRC15_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG5) ADC Trigger Event User 10  */
#define ADC_CHNCFG5_TRGSRC15_NO_TRIGGER       (ADC_CHNCFG5_TRGSRC15_NO_TRIGGER_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) No Trigger (NOP) Position  */
#define ADC_CHNCFG5_TRGSRC15_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG5_TRGSRC15_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) Global Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC15_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG5_TRGSRC15_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) Global Level Software Trigger Position  */
#define ADC_CHNCFG5_TRGSRC15_SCAN_TRIGGER     (ADC_CHNCFG5_TRGSRC15_SCAN_TRIGGER_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG5_TRGSRC15_SYNC_TRIGGER     (ADC_CHNCFG5_TRGSRC15_SYNC_TRIGGER_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER0      (ADC_CHNCFG5_TRGSRC15_EVENT_USER0_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER1      (ADC_CHNCFG5_TRGSRC15_EVENT_USER1_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER2      (ADC_CHNCFG5_TRGSRC15_EVENT_USER2_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER3      (ADC_CHNCFG5_TRGSRC15_EVENT_USER3_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER4      (ADC_CHNCFG5_TRGSRC15_EVENT_USER4_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER5      (ADC_CHNCFG5_TRGSRC15_EVENT_USER5_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER6      (ADC_CHNCFG5_TRGSRC15_EVENT_USER6_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER7      (ADC_CHNCFG5_TRGSRC15_EVENT_USER7_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER8      (ADC_CHNCFG5_TRGSRC15_EVENT_USER8_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER9      (ADC_CHNCFG5_TRGSRC15_EVENT_USER9_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG5_TRGSRC15_EVENT_USER10     (ADC_CHNCFG5_TRGSRC15_EVENT_USER10_Val << ADC_CHNCFG5_TRGSRC15_Pos) /* (ADC_CHNCFG5) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG5_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ADC_CHNCFG5) Register Mask  */


/* -------- ADC_CALCTRL : (ADC Offset: 0x18) (R/W 32) SARCORE Calibration Value -------- */
#define ADC_CALCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_CALCTRL) SARCORE Calibration Value  Reset Value */

#define ADC_CALCTRL_CALBITS_Pos               _UINT32_(0)                                          /* (ADC_CALCTRL) Calibration Values Position */
#define ADC_CALCTRL_CALBITS_Msk               (_UINT32_(0xFFFFFFFF) << ADC_CALCTRL_CALBITS_Pos)    /* (ADC_CALCTRL) Calibration Values Mask */
#define ADC_CALCTRL_CALBITS(value)            (ADC_CALCTRL_CALBITS_Msk & (_UINT32_(value) << ADC_CALCTRL_CALBITS_Pos)) /* Assigment of value for CALBITS in the ADC_CALCTRL register */
#define ADC_CALCTRL_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ADC_CALCTRL) Register Mask  */

