jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/adc.h
/* -------- ADC_CTRLB : (ADC Offset: 0x04) (R/W 32) CONTROL B REGISTER -------- */
#define ADC_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLB) CONTROL B REGISTER  Reset Value */

#define ADC_CTRLB_ADCHSEL_Pos                 _UINT32_(0)                                          /* (ADC_CTRLB) Software Trigger Channel Select Position */
#define ADC_CTRLB_ADCHSEL_Msk                 (_UINT32_(0xF) << ADC_CTRLB_ADCHSEL_Pos)             /* (ADC_CTRLB) Software Trigger Channel Select Mask */
#define ADC_CTRLB_ADCHSEL(value)              (ADC_CTRLB_ADCHSEL_Msk & (_UINT32_(value) << ADC_CTRLB_ADCHSEL_Pos)) /* Assigment of value for ADCHSEL in the ADC_CTRLB register */
#define ADC_CTRLB_ADCORSEL_Pos                _UINT32_(4)                                          /* (ADC_CTRLB) Software Trigger Core Select Position */
#define ADC_CTRLB_ADCORSEL_Msk                (_UINT32_(0x3) << ADC_CTRLB_ADCORSEL_Pos)            /* (ADC_CTRLB) Software Trigger Core Select Mask */
#define ADC_CTRLB_ADCORSEL(value)             (ADC_CTRLB_ADCORSEL_Msk & (_UINT32_(value) << ADC_CTRLB_ADCORSEL_Pos)) /* Assigment of value for ADCORSEL in the ADC_CTRLB register */
#define ADC_CTRLB_RQCNVRT_Pos                 _UINT32_(6)                                          /* (ADC_CTRLB) Request Channel Convert Position */
#define ADC_CTRLB_RQCNVRT_Msk                 (_UINT32_(0x1) << ADC_CTRLB_RQCNVRT_Pos)             /* (ADC_CTRLB) Request Channel Convert Mask */
#define ADC_CTRLB_RQCNVRT(value)              (ADC_CTRLB_RQCNVRT_Msk & (_UINT32_(value) << ADC_CTRLB_RQCNVRT_Pos)) /* Assigment of value for RQCNVRT in the ADC_CTRLB register */
#define ADC_CTRLB_SAMP_Pos                    _UINT32_(7)                                          /* (ADC_CTRLB) Channel Sample Position */
#define ADC_CTRLB_SAMP_Msk                    (_UINT32_(0x1) << ADC_CTRLB_SAMP_Pos)                /* (ADC_CTRLB) Channel Sample Mask */
#define ADC_CTRLB_SAMP(value)                 (ADC_CTRLB_SAMP_Msk & (_UINT32_(value) << ADC_CTRLB_SAMP_Pos)) /* Assigment of value for SAMP in the ADC_CTRLB register */
#define ADC_CTRLB_GSWTRG_Pos                  _UINT32_(8)                                          /* (ADC_CTRLB) Global Software Trigger Position */
#define ADC_CTRLB_GSWTRG_Msk                  (_UINT32_(0x1) << ADC_CTRLB_GSWTRG_Pos)              /* (ADC_CTRLB) Global Software Trigger Mask */
#define ADC_CTRLB_GSWTRG(value)               (ADC_CTRLB_GSWTRG_Msk & (_UINT32_(value) << ADC_CTRLB_GSWTRG_Pos)) /* Assigment of value for GSWTRG in the ADC_CTRLB register */
#define ADC_CTRLB_LSWTRG_Pos                  _UINT32_(9)                                          /* (ADC_CTRLB) Level Global Trigger Position */
#define ADC_CTRLB_LSWTRG_Msk                  (_UINT32_(0x1) << ADC_CTRLB_LSWTRG_Pos)              /* (ADC_CTRLB) Level Global Trigger Mask */
#define ADC_CTRLB_LSWTRG(value)               (ADC_CTRLB_LSWTRG_Msk & (_UINT32_(value) << ADC_CTRLB_LSWTRG_Pos)) /* Assigment of value for LSWTRG in the ADC_CTRLB register */
#define ADC_CTRLB_TRGSUSP_Pos                 _UINT32_(10)                                         /* (ADC_CTRLB) Trigger Suspend Position */
#define ADC_CTRLB_TRGSUSP_Msk                 (_UINT32_(0x1) << ADC_CTRLB_TRGSUSP_Pos)             /* (ADC_CTRLB) Trigger Suspend Mask */
#define ADC_CTRLB_TRGSUSP(value)              (ADC_CTRLB_TRGSUSP_Msk & (_UINT32_(value) << ADC_CTRLB_TRGSUSP_Pos)) /* Assigment of value for TRGSUSP in the ADC_CTRLB register */
#define ADC_CTRLB_SWCNVEN_Pos                 _UINT32_(15)                                         /* (ADC_CTRLB) Software Conversion Enable Position */
#define ADC_CTRLB_SWCNVEN_Msk                 (_UINT32_(0x1) << ADC_CTRLB_SWCNVEN_Pos)             /* (ADC_CTRLB) Software Conversion Enable Mask */
#define ADC_CTRLB_SWCNVEN(value)              (ADC_CTRLB_SWCNVEN_Msk & (_UINT32_(value) << ADC_CTRLB_SWCNVEN_Pos)) /* Assigment of value for SWCNVEN in the ADC_CTRLB register */
#define ADC_CTRLB_Msk                         _UINT32_(0x000087FF)                                 /* (ADC_CTRLB) Register Mask  */


/* -------- ADC_CTRLC : (ADC Offset: 0x08) (R/W 32) Control C Register -------- */
#define ADC_CTRLC_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLC) Control C Register  Reset Value */

#define ADC_CTRLC_CNT_Pos                     _UINT32_(0)                                          /* (ADC_CTRLC) Clock Divider for Synchronous Trigger Position */
#define ADC_CTRLC_CNT_Msk                     (_UINT32_(0xFFFF) << ADC_CTRLC_CNT_Pos)              /* (ADC_CTRLC) Clock Divider for Synchronous Trigger Mask */
#define ADC_CTRLC_CNT(value)                  (ADC_CTRLC_CNT_Msk & (_UINT32_(value) << ADC_CTRLC_CNT_Pos)) /* Assigment of value for CNT in the ADC_CTRLC register */
#define ADC_CTRLC_COREINTERLEAVED_Pos         _UINT32_(28)                                         /* (ADC_CTRLC) Number of Core to Interleave Triggers Position */
#define ADC_CTRLC_COREINTERLEAVED_Msk         (_UINT32_(0x7) << ADC_CTRLC_COREINTERLEAVED_Pos)     /* (ADC_CTRLC) Number of Core to Interleave Triggers Mask */
#define ADC_CTRLC_COREINTERLEAVED(value)      (ADC_CTRLC_COREINTERLEAVED_Msk & (_UINT32_(value) << ADC_CTRLC_COREINTERLEAVED_Pos)) /* Assigment of value for COREINTERLEAVED in the ADC_CTRLC register */
#define   ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_OFF_Val _UINT32_(0x0)                                        /* (ADC_CTRLC) Interleaving Off  */
#define   ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_Val _UINT32_(0x4)                                        /* (ADC_CTRLC) Interleaving Cores 0 and 1  */
#define   ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_1_2_Val _UINT32_(0x1)                                        /* (ADC_CTRLC) Interleaving Cores 1 and 2  */
#define   ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_2_Val _UINT32_(0x5)                                        /* (ADC_CTRLC) Interleaving Cores 0, 1 and 2  */
#define   ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_1_2_3_Val _UINT32_(0x2)                                        /* (ADC_CTRLC) Interleaving Cores 1, 2 and 3  */
#define   ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_2_3_Val _UINT32_(0x3)                                        /* (ADC_CTRLC) Interleaving Cores 0, 1, 2 and 3  */
#define ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_OFF (ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_OFF_Val << ADC_CTRLC_COREINTERLEAVED_Pos) /* (ADC_CTRLC) Interleaving Off Position  */
#define ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1 (ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_Val << ADC_CTRLC_COREINTERLEAVED_Pos) /* (ADC_CTRLC) Interleaving Cores 0 and 1 Position  */
#define ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_1_2 (ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_1_2_Val << ADC_CTRLC_COREINTERLEAVED_Pos) /* (ADC_CTRLC) Interleaving Cores 1 and 2 Position  */
#define ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_2 (ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_2_Val << ADC_CTRLC_COREINTERLEAVED_Pos) /* (ADC_CTRLC) Interleaving Cores 0, 1 and 2 Position  */
#define ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_1_2_3 (ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_1_2_3_Val << ADC_CTRLC_COREINTERLEAVED_Pos) /* (ADC_CTRLC) Interleaving Cores 1, 2 and 3 Position  */
#define ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_2_3 (ADC_CTRLC_COREINTERLEAVED_INTERLEAVING_CORES_0_1_2_3_Val << ADC_CTRLC_COREINTERLEAVED_Pos) /* (ADC_CTRLC) Interleaving Cores 0, 1, 2 and 3 Position  */
#define ADC_CTRLC_Msk                         _UINT32_(0x7000FFFF)                                 /* (ADC_CTRLC) Register Mask  */


