jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/adc.h
/* -------- ADC_SYNCBUSY : (ADC Offset: 0xE8) ( R/ 32) CORE SYNC Busy Status Register -------- */
#define ADC_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (ADC_SYNCBUSY) CORE SYNC Busy Status Register  Reset Value */

#define ADC_SYNCBUSY_ENABLE_Pos               _UINT32_(0)                                          /* (ADC_SYNCBUSY) Enable bit Sync Busy Position */
#define ADC_SYNCBUSY_ENABLE_Msk               (_UINT32_(0x1) << ADC_SYNCBUSY_ENABLE_Pos)           /* (ADC_SYNCBUSY) Enable bit Sync Busy Mask */
#define ADC_SYNCBUSY_ENABLE(value)            (ADC_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << ADC_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the ADC_SYNCBUSY register */
#define ADC_SYNCBUSY_CTRLB_Pos                _UINT32_(2)                                          /* (ADC_SYNCBUSY) CTRLB sync busy Position */
#define ADC_SYNCBUSY_CTRLB_Msk                (_UINT32_(0x1) << ADC_SYNCBUSY_CTRLB_Pos)            /* (ADC_SYNCBUSY) CTRLB sync busy Mask */
#define ADC_SYNCBUSY_CTRLB(value)             (ADC_SYNCBUSY_CTRLB_Msk & (_UINT32_(value) << ADC_SYNCBUSY_CTRLB_Pos)) /* Assigment of value for CTRLB in the ADC_SYNCBUSY register */
#define ADC_SYNCBUSY_SWRST_Pos                _UINT32_(24)                                         /* (ADC_SYNCBUSY) Software Reset Sync Busy Position */
#define ADC_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << ADC_SYNCBUSY_SWRST_Pos)            /* (ADC_SYNCBUSY) Software Reset Sync Busy Mask */
#define ADC_SYNCBUSY_SWRST(value)             (ADC_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << ADC_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the ADC_SYNCBUSY register */
#define ADC_SYNCBUSY_Msk                      _UINT32_(0x01000005)                                 /* (ADC_SYNCBUSY) Register Mask  */


/* -------- ADC_TESTREG : (ADC Offset: 0xEC) (R/W 32) Test Control Register -------- */
#define ADC_TESTREG_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_TESTREG) Test Control Register  Reset Value */

#define ADC_TESTREG_TESTEN_Pos                _UINT32_(0)                                          /* (ADC_TESTREG) Test Mode Enable Position */
#define ADC_TESTREG_TESTEN_Msk                (_UINT32_(0x1) << ADC_TESTREG_TESTEN_Pos)            /* (ADC_TESTREG) Test Mode Enable Mask */
#define ADC_TESTREG_TESTEN(value)             (ADC_TESTREG_TESTEN_Msk & (_UINT32_(value) << ADC_TESTREG_TESTEN_Pos)) /* Assigment of value for TESTEN in the ADC_TESTREG register */
#define ADC_TESTREG_EN_ATEST_Pos              _UINT32_(16)                                         /* (ADC_TESTREG) Analog Test Circuitry Enables Position */
#define ADC_TESTREG_EN_ATEST_Msk              (_UINT32_(0xF) << ADC_TESTREG_EN_ATEST_Pos)          /* (ADC_TESTREG) Analog Test Circuitry Enables Mask */
#define ADC_TESTREG_EN_ATEST(value)           (ADC_TESTREG_EN_ATEST_Msk & (_UINT32_(value) << ADC_TESTREG_EN_ATEST_Pos)) /* Assigment of value for EN_ATEST in the ADC_TESTREG register */
#define ADC_TESTREG_ADCHSEL_Pos               _UINT32_(24)                                         /* (ADC_TESTREG) Channel Select Position */
#define ADC_TESTREG_ADCHSEL_Msk               (_UINT32_(0xF) << ADC_TESTREG_ADCHSEL_Pos)           /* (ADC_TESTREG) Channel Select Mask */
#define ADC_TESTREG_ADCHSEL(value)            (ADC_TESTREG_ADCHSEL_Msk & (_UINT32_(value) << ADC_TESTREG_ADCHSEL_Pos)) /* Assigment of value for ADCHSEL in the ADC_TESTREG register */
#define ADC_TESTREG_ADCORSEL_Pos              _UINT32_(28)                                         /* (ADC_TESTREG) Core Select Position */
#define ADC_TESTREG_ADCORSEL_Msk              (_UINT32_(0x3) << ADC_TESTREG_ADCORSEL_Pos)          /* (ADC_TESTREG) Core Select Mask */
#define ADC_TESTREG_ADCORSEL(value)           (ADC_TESTREG_ADCORSEL_Msk & (_UINT32_(value) << ADC_TESTREG_ADCORSEL_Pos)) /* Assigment of value for ADCORSEL in the ADC_TESTREG register */
#define ADC_TESTREG_Msk                       _UINT32_(0x3F0F0001)                                 /* (ADC_TESTREG) Register Mask  */


/* -------- ADC_DMAINTENCLR : (ADC Offset: 0xF0) (R/W 32) DMA Interrupt Enable Clear -------- */
#define ADC_DMAINTENCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (ADC_DMAINTENCLR) DMA Interrupt Enable Clear  Reset Value */

#define ADC_DMAINTENCLR_RAF_Pos               _UINT32_(0)                                          /* (ADC_DMAINTENCLR) Ram Buffer A Full Position */
#define ADC_DMAINTENCLR_RAF_Msk               (_UINT32_(0xF) << ADC_DMAINTENCLR_RAF_Pos)           /* (ADC_DMAINTENCLR) Ram Buffer A Full Mask */
#define ADC_DMAINTENCLR_RAF(value)            (ADC_DMAINTENCLR_RAF_Msk & (_UINT32_(value) << ADC_DMAINTENCLR_RAF_Pos)) /* Assigment of value for RAF in the ADC_DMAINTENCLR register */
#define ADC_DMAINTENCLR_RBF_Pos               _UINT32_(4)                                          /* (ADC_DMAINTENCLR) Ram Buffer B Full Position */
#define ADC_DMAINTENCLR_RBF_Msk               (_UINT32_(0xF) << ADC_DMAINTENCLR_RBF_Pos)           /* (ADC_DMAINTENCLR) Ram Buffer B Full Mask */
#define ADC_DMAINTENCLR_RBF(value)            (ADC_DMAINTENCLR_RBF_Msk & (_UINT32_(value) << ADC_DMAINTENCLR_RBF_Pos)) /* Assigment of value for RBF in the ADC_DMAINTENCLR register */
#define ADC_DMAINTENCLR_SOVFL_Pos             _UINT32_(16)                                         /* (ADC_DMAINTENCLR) Synchonizer Overflow Position */
#define ADC_DMAINTENCLR_SOVFL_Msk             (_UINT32_(0x1) << ADC_DMAINTENCLR_SOVFL_Pos)         /* (ADC_DMAINTENCLR) Synchonizer Overflow Mask */
#define ADC_DMAINTENCLR_SOVFL(value)          (ADC_DMAINTENCLR_SOVFL_Msk & (_UINT32_(value) << ADC_DMAINTENCLR_SOVFL_Pos)) /* Assigment of value for SOVFL in the ADC_DMAINTENCLR register */
#define ADC_DMAINTENCLR_Msk                   _UINT32_(0x000100FF)                                 /* (ADC_DMAINTENCLR) Register Mask  */


