jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/adc.h
#define ADC_DIGTSTOUT_ADCDIGTST_Pos           _UINT32_(0)                                          /* (ADC_DIGTSTOUT) Digital Debug Test port Register Position */
#define ADC_DIGTSTOUT_ADCDIGTST_Msk           (_UINT32_(0xFFFFFFFF) << ADC_DIGTSTOUT_ADCDIGTST_Pos) /* (ADC_DIGTSTOUT) Digital Debug Test port Register Mask */
#define ADC_DIGTSTOUT_ADCDIGTST(value)        (ADC_DIGTSTOUT_ADCDIGTST_Msk & (_UINT32_(value) << ADC_DIGTSTOUT_ADCDIGTST_Pos)) /* Assigment of value for ADCDIGTST in the ADC_DIGTSTOUT register */
#define ADC_DIGTSTOUT_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADC_DIGTSTOUT) Register Mask  */


/* -------- ADC_TSTIDOUT : (ADC Offset: 0x164) (R/W 32) Test Degug2 Register -------- */
#define ADC_TSTIDOUT_RESETVALUE               _UINT32_(0x00)                                       /*  (ADC_TSTIDOUT) Test Degug2 Register  Reset Value */

#define ADC_TSTIDOUT_TSTCORID_Pos             _UINT32_(0)                                          /* (ADC_TSTIDOUT) Core Digital Test Out Read ID Position */
#define ADC_TSTIDOUT_TSTCORID_Msk             (_UINT32_(0x1) << ADC_TSTIDOUT_TSTCORID_Pos)         /* (ADC_TSTIDOUT) Core Digital Test Out Read ID Mask */
#define ADC_TSTIDOUT_TSTCORID(value)          (ADC_TSTIDOUT_TSTCORID_Msk & (_UINT32_(value) << ADC_TSTIDOUT_TSTCORID_Pos)) /* Assigment of value for TSTCORID in the ADC_TSTIDOUT register */
#define ADC_TSTIDOUT_Msk                      _UINT32_(0x00000001)                                 /* (ADC_TSTIDOUT) Register Mask  */


/* -------- ADC_DBGCTRL : (ADC Offset: 0x168) (R/W 32) Debug Control Register -------- */
#define ADC_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_DBGCTRL) Debug Control Register  Reset Value */

#define ADC_DBGCTRL_DBGRUN_Pos                _UINT32_(0)                                          /* (ADC_DBGCTRL) Debug Running State Position */
#define ADC_DBGCTRL_DBGRUN_Msk                (_UINT32_(0x1) << ADC_DBGCTRL_DBGRUN_Pos)            /* (ADC_DBGCTRL) Debug Running State Mask */
#define ADC_DBGCTRL_DBGRUN(value)             (ADC_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << ADC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the ADC_DBGCTRL register */
#define ADC_DBGCTRL_Msk                       _UINT32_(0x00000001)                                 /* (ADC_DBGCTRL) Register Mask  */


/** \brief ADC register offsets definitions */
#define ADC_CORCTRL_REG_OFST           _UINT32_(0x00)      /* (ADC_CORCTRL) SARCORE Control Offset */
#define ADC_CHNCFG1_REG_OFST           _UINT32_(0x04)      /* (ADC_CHNCFG1) Channel Configuration 1 (LVL/CMPEN) Offset */
#define ADC_CHNCFG2_REG_OFST           _UINT32_(0x08)      /* (ADC_CHNCFG2) Channel Configuration 2(FRACT/CSS) Offset */
#define ADC_CHNCFG3_REG_OFST           _UINT32_(0x0C)      /* (ADC_CHNCFG3) Channel Configuration3 (SIGN/DIFF) Offset */
#define ADC_CHNCFG4_REG_OFST           _UINT32_(0x10)      /* (ADC_CHNCFG4) Channel Configuration 4 (TRGSRC) Offset */
#define ADC_CHNCFG5_REG_OFST           _UINT32_(0x14)      /* (ADC_CHNCFG5) Channel Configuration 5 (TRGSRC) Offset */
#define ADC_CALCTRL_REG_OFST           _UINT32_(0x18)      /* (ADC_CALCTRL) SARCORE Calibration Value Offset */
#define ADC_EVCTRL_REG_OFST            _UINT32_(0x1C)      /* (ADC_EVCTRL) Event Control Offset */
#define ADC_INTENCLR_REG_OFST          _UINT32_(0x00)      /* (ADC_INTENCLR) Interrupt Enable Clear Offset */
#define ADC_INTENSET_REG_OFST          _UINT32_(0x04)      /* (ADC_INTENSET) Interrupt Enable Set Offset */
#define ADC_INTFLAG_REG_OFST           _UINT32_(0x08)      /* (ADC_INTFLAG) Interrupt Flags Offset */
#define ADC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (ADC_CTRLA) CONTROL A REGISTER Offset */
#define ADC_CTRLB_REG_OFST             _UINT32_(0x04)      /* (ADC_CTRLB) CONTROL B REGISTER Offset */
#define ADC_CTRLC_REG_OFST             _UINT32_(0x08)      /* (ADC_CTRLC) Control C Register Offset */
#define ADC_CTRLD_REG_OFST             _UINT32_(0x10)      /* (ADC_CTRLD) Control D Register Offset */
#define ADC_CMPCTRL_REG_OFST           _UINT32_(0xB0)      /* (ADC_CMPCTRL) Comparator Control Offset */
#define ADC_CMPCTRL0_REG_OFST          _UINT32_(0xB0)      /* (ADC_CMPCTRL0) Comparator Control Offset */
#define ADC_CMPCTRL1_REG_OFST          _UINT32_(0xB4)      /* (ADC_CMPCTRL1) Comparator Control Offset */
#define ADC_CMPCTRL2_REG_OFST          _UINT32_(0xB8)      /* (ADC_CMPCTRL2) Comparator Control Offset */
#define ADC_CMPCTRL3_REG_OFST          _UINT32_(0xBC)      /* (ADC_CMPCTRL3) Comparator Control Offset */
#define ADC_FLTCTRL_REG_OFST           _UINT32_(0xC0)      /* (ADC_FLTCTRL) Filter Control Offset */
#define ADC_FLTCTRL0_REG_OFST          _UINT32_(0xC0)      /* (ADC_FLTCTRL0) Filter Control Offset */
#define ADC_FLTCTRL1_REG_OFST          _UINT32_(0xC4)      /* (ADC_FLTCTRL1) Filter Control Offset */
#define ADC_FLTCTRL2_REG_OFST          _UINT32_(0xC8)      /* (ADC_FLTCTRL2) Filter Control Offset */
#define ADC_FLTCTRL3_REG_OFST          _UINT32_(0xCC)      /* (ADC_FLTCTRL3) Filter Control Offset */
#define ADC_CORCHDATAID_REG_OFST       _UINT32_(0xD0)      /* (ADC_CORCHDATAID) Channel Ready DATA ID Offset */
#define ADC_CHRDYDAT_REG_OFST          _UINT32_(0xD4)      /* (ADC_CHRDYDAT) Channel Ready Data Register Offset */
#define ADC_PFFDATA_REG_OFST           _UINT32_(0xD8)      /* (ADC_PFFDATA) APB FIFO Output Data Offset */
#define ADC_DMABASE_REG_OFST           _UINT32_(0xDC)      /* (ADC_DMABASE) DMA Sample Base Address Offset */
#define ADC_DMACTRL_REG_OFST           _UINT32_(0xE0)      /* (ADC_DMACTRL) DMA Control Register Offset */
#define ADC_PFFCTRL_REG_OFST           _UINT32_(0xE4)      /* (ADC_PFFCTRL) APB FIFO Control Register Offset */
#define ADC_SYNCBUSY_REG_OFST          _UINT32_(0xE8)      /* (ADC_SYNCBUSY) CORE SYNC Busy Status Register Offset */
#define ADC_TESTREG_REG_OFST           _UINT32_(0xEC)      /* (ADC_TESTREG) Test Control Register Offset */
#define ADC_DMAINTENCLR_REG_OFST       _UINT32_(0xF0)      /* (ADC_DMAINTENCLR) DMA Interrupt Enable Clear Offset */
#define ADC_DMAINTSET_REG_OFST         _UINT32_(0xF4)      /* (ADC_DMAINTSET) DMA Interrupt Enable Set Offset */
#define ADC_DMAINTFLAG_REG_OFST        _UINT32_(0xF8)      /* (ADC_DMAINTFLAG) DMA Interrupt Flag and Status Offset */
#define ADC_CTLINTENSET_REG_OFST       _UINT32_(0xFC)      /* (ADC_CTLINTENSET) CORE Controller Interrupt Enable Set Offset */
#define ADC_CTLINTENCLR_REG_OFST       _UINT32_(0x100)     /* (ADC_CTLINTENCLR) CORE Controller Interrupt Enable Clear Offset */
#define ADC_CTLINTFLAG_REG_OFST        _UINT32_(0x104)     /* (ADC_CTLINTFLAG) CORE Controller Interrupt Flags Offset */
#define ADC_DIGTSTOUT_REG_OFST         _UINT32_(0x160)     /* (ADC_DIGTSTOUT) Test Debug Register Offset */
#define ADC_TSTIDOUT_REG_OFST          _UINT32_(0x164)     /* (ADC_TSTIDOUT) Test Degug2 Register Offset */
#define ADC_DBGCTRL_REG_OFST           _UINT32_(0x168)     /* (ADC_DBGCTRL) Debug Control Register Offset */

