jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/adc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CONFIG register API structure */
typedef struct
{
  __IO  uint32_t                       ADC_CORCTRL;        /**< Offset: 0x00 (R/W  32) SARCORE Control */
  __IO  uint32_t                       ADC_CHNCFG1;        /**< Offset: 0x04 (R/W  32) Channel Configuration 1 (LVL/CMPEN) */
  __IO  uint32_t                       ADC_CHNCFG2;        /**< Offset: 0x08 (R/W  32) Channel Configuration 2(FRACT/CSS) */
  __IO  uint32_t                       ADC_CHNCFG3;        /**< Offset: 0x0C (R/W  32) Channel Configuration3 (SIGN/DIFF) */
  __IO  uint32_t                       ADC_CHNCFG4;        /**< Offset: 0x10 (R/W  32) Channel Configuration 4 (TRGSRC) */
  __IO  uint32_t                       ADC_CHNCFG5;        /**< Offset: 0x14 (R/W  32) Channel Configuration 5 (TRGSRC) */
  __IO  uint32_t                       ADC_CALCTRL;        /**< Offset: 0x18 (R/W  32) SARCORE Calibration Value */
  __IO  uint32_t                       ADC_EVCTRL;         /**< Offset: 0x1C (R/W  32) Event Control */
} adc_config_registers_t;

/** \brief INT register API structure */
typedef struct
{
  __IO  uint32_t                       ADC_INTENCLR;       /**< Offset: 0x00 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       ADC_INTENSET;       /**< Offset: 0x04 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       ADC_INTFLAG;        /**< Offset: 0x08 (R/W  32) Interrupt Flags */
  __I   uint8_t                        Reserved1[0x04];
} adc_int_registers_t;

#define ADC_CONFIG_NUMBER 4

#define ADC_INT_NUMBER 4

/** \brief ADC register API structure */
typedef struct
{  /* ADC Controller */
  __IO  uint32_t                       ADC_CTRLA;          /**< Offset: 0x00 (R/W  32) CONTROL A REGISTER */
  __IO  uint32_t                       ADC_CTRLB;          /**< Offset: 0x04 (R/W  32) CONTROL B REGISTER */
  __IO  uint32_t                       ADC_CTRLC;          /**< Offset: 0x08 (R/W  32) Control C Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       ADC_CTRLD;          /**< Offset: 0x10 (R/W  32) Control D Register */
  __I   uint8_t                        Reserved2[0x0C];
        adc_config_registers_t         CONFIG[ADC_CONFIG_NUMBER]; /**< Offset: 0x20  */
  __I   uint8_t                        Reserved3[0x10];
  __IO  uint32_t                       ADC_CMPCTRL[4];     /**< Offset: 0xB0 (R/W  32) Comparator Control */
  __IO  uint32_t                       ADC_FLTCTRL[4];     /**< Offset: 0xC0 (R/W  32) Filter Control */
  __IO  uint32_t                       ADC_CORCHDATAID;    /**< Offset: 0xD0 (R/W  32) Channel Ready DATA ID */
  __IO  uint32_t                       ADC_CHRDYDAT;       /**< Offset: 0xD4 (R/W  32) Channel Ready Data Register */
  __I   uint32_t                       ADC_PFFDATA;        /**< Offset: 0xD8 (R/   32) APB FIFO Output Data */
  __IO  uint32_t                       ADC_DMABASE;        /**< Offset: 0xDC (R/W  32) DMA Sample Base Address */
  __IO  uint32_t                       ADC_DMACTRL;        /**< Offset: 0xE0 (R/W  32) DMA Control Register */
  __IO  uint32_t                       ADC_PFFCTRL;        /**< Offset: 0xE4 (R/W  32) APB FIFO Control Register */
  __I   uint32_t                       ADC_SYNCBUSY;       /**< Offset: 0xE8 (R/   32) CORE SYNC Busy Status Register */
  __IO  uint32_t                       ADC_TESTREG;        /**< Offset: 0xEC (R/W  32) Test Control Register */
  __IO  uint32_t                       ADC_DMAINTENCLR;    /**< Offset: 0xF0 (R/W  32) DMA Interrupt Enable Clear */
  __IO  uint32_t                       ADC_DMAINTSET;      /**< Offset: 0xF4 (R/W  32) DMA Interrupt Enable Set */
  __IO  uint32_t                       ADC_DMAINTFLAG;     /**< Offset: 0xF8 (R/W  32) DMA Interrupt Flag and Status */
  __IO  uint32_t                       ADC_CTLINTENSET;    /**< Offset: 0xFC (R/W  32) CORE Controller Interrupt Enable Set */
  __IO  uint32_t                       ADC_CTLINTENCLR;    /**< Offset: 0x100 (R/W  32) CORE Controller Interrupt Enable Clear */
  __IO  uint32_t                       ADC_CTLINTFLAG;     /**< Offset: 0x104 (R/W  32) CORE Controller Interrupt Flags */
  __I   uint8_t                        Reserved4[0x18];
        adc_int_registers_t            INT[ADC_INT_NUMBER]; /**< Offset: 0x120  */
  __I   uint32_t                       ADC_DIGTSTOUT;      /**< Offset: 0x160 (R/   32) Test Debug Register */
  __IO  uint32_t                       ADC_TSTIDOUT;       /**< Offset: 0x164 (R/W  32) Test Degug2 Register */
  __IO  uint32_t                       ADC_DBGCTRL;        /**< Offset: 0x168 (R/W  32) Debug Control Register */
} adc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA90_ADC_COMPONENT_H_ */
